{
  "add_cross_attention": false,
  "architectures": [
    "RobertaForSequenceClassification"
  ],
  "attention_probs_dropout_prob": 0.1,
  "bos_token_id": 0,
  "classifier_dropout": null,
  "dtype": "float32",
  "eos_token_id": 2,
  "gradient_checkpointing": false,
  "hidden_act": "gelu",
  "hidden_dropout_prob": 0.1,
  "hidden_size": 1024,
  "id2label": {
    "0": "'\ud574\uc57c \ud55c\ub2e4' \uc9c4\uc220",
    "1": "\uac10\uc815\uc801 \ucd94\ub860",
    "2": "\uac1c\uc778\ud654",
    "3": "\uacfc\uc789 \uc77c\ubc18\ud654",
    "4": "\uae0d\uc815 \ucd95\uc18c\ud654",
    "5": "\ub099\uc778\ucc0d\uae30",
    "6": "\ubd80\uc815\uc801 \ud3b8\ud5a5",
    "7": "\ubd88\ucda9\ubd84",
    "8": "\uc131\uae09\ud55c \ud310\ub2e8",
    "9": "\uc815\uc0c1",
    "10": "\ud655\ub300\uc640 \ucd95\uc18c",
    "11": "\ud751\ubc31 \uc0ac\uace0"
  },
  "initializer_range": 0.02,
  "intermediate_size": 4096,
  "is_decoder": false,
  "label2id": {
    "'\ud574\uc57c \ud55c\ub2e4' \uc9c4\uc220": 0,
    "\uac10\uc815\uc801 \ucd94\ub860": 1,
    "\uac1c\uc778\ud654": 2,
    "\uacfc\uc789 \uc77c\ubc18\ud654": 3,
    "\uae0d\uc815 \ucd95\uc18c\ud654": 4,
    "\ub099\uc778\ucc0d\uae30": 5,
    "\ubd80\uc815\uc801 \ud3b8\ud5a5": 6,
    "\ubd88\ucda9\ubd84": 7,
    "\uc131\uae09\ud55c \ud310\ub2e8": 8,
    "\uc815\uc0c1": 9,
    "\ud655\ub300\uc640 \ucd95\uc18c": 10,
    "\ud751\ubc31 \uc0ac\uace0": 11
  },
  "layer_norm_eps": 1e-05,
  "max_position_embeddings": 514,
  "model_type": "roberta",
  "num_attention_heads": 16,
  "num_hidden_layers": 24,
  "pad_token_id": 1,
  "problem_type": "multi_label_classification",
  "tie_word_embeddings": true,
  "tokenizer_class": "BertTokenizer",
  "transformers_version": "5.12.0",
  "type_vocab_size": 1,
  "use_cache": false,
  "vocab_size": 32000
}
